# A Series contain multiple columns.It has one parameter:

In [1]:
import pandas as pd
import numpy as np 
info= np.array(['p','a','n','d','a','s'])
a=pd.Series(info)
print(info)
print(a)

['p' 'a' 'n' 'd' 'a' 's']
0    p
1    a
2    n
3    d
4    a
5    s
dtype: object

In [2]:
d={'a':0.,'b':1.,'c':2.}    #dict
print(d)
a=pd.Series(d)
print(a)
type(a)

{'a': 0.0, 'b': 1.0, 'c': 2.0}
a    0.0
b    1.0
c    2.0
dtype: float64

pandas.core.series.Series

In [3]:
a.index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
print(a.values)

[0. 1. 2.]

In [5]:
pd.Series(5, index=['a','b','c','d','e']) #scalar

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [9]:
s=pd.Series(np.random.randn(5),index=['a','b','c','d','e'])
s

a    0.741729
b   -0.738983
c    0.028006
d    1.442572
e   -0.095946
dtype: float64

In [10]:
print("type of data",type(s))

type of data <class 'pandas.core.series.Series'>

In [13]:
print(s.shape)
print(s.ndim)
print(s.size)
print(s.nbytes)  #5*8

(5,)
1
5
40

In [14]:
#indexing and slicing
s[0]

0.741728635550981

In [16]:
s[:3]

a    0.741729
b   -0.738983
c    0.028006
dtype: float64

In [17]:
print(s.median())
s[s>s.median()]

0.028006301621039252

a    0.741729
d    1.442572
dtype: float64

In [18]:
s>s.median()

a     True
b    False
c    False
d     True
e    False
dtype: bool

In [19]:
s[[4,3,1]]

e   -0.095946
d    1.442572
b   -0.738983
dtype: float64

In [20]:
s+s

a    1.483457
b   -1.477966
c    0.056013
d    2.885144
e   -0.191891
dtype: float64

In [21]:
s*2

a    1.483457
b   -1.477966
c    0.056013
d    2.885144
e   -0.191891
dtype: float64

In [22]:
np.exp(s)

a    2.099562
b    0.477599
c    1.028402
d    4.231566
e    0.908513
dtype: float64

In [23]:
s[1:]+s[:-1]

a         NaN
b   -1.477966
c    0.056013
d    2.885144
e         NaN
dtype: float64

In [24]:
s['e']=12
s

a     0.741729
b    -0.738983
c     0.028006
d     1.442572
e    12.000000
dtype: float64

In [25]:
'e' in s

True

In [26]:
'f' in s

False

In [27]:
#Checking Emptiness and NaN vales
a=pd.Series(data=[1,2,3,np.NaN])
b=pd.Series(data=[4.9,8.2,5.5],index=['x','y','z'])
c=pd.Series()
print(a)
print(b)
print(c)
print(a.empty,b.empty,c.empty)
print(a.hasnans,b.hasnans,c.hasnans)
print(len(a),len(b))
print(a.count(),b.count())

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64
x    4.9
y    8.2
z    5.5
dtype: float64
Series([], dtype: float64)
False False True
True False False
4 3
3 3

<ipython-input-27-24c815ce59c3>:4: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  c=pd.Series()

In [28]:
x=['Python','Pandas'] #a list of strings

#Calling DataFrame constructor on list
df= pd.DataFrame(x)
print(df)

        0
0  Python
1  Pandas

In [29]:
d={'one':[1.,2.,3.,4.],'two':[4.,3.,2.,1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [30]:
pd.DataFrame([[1,2],[5,6]],index=['a','b'],columns=['x','y'])

   x  y
a  1  2
b  5  6

In [32]:
d={'one': pd.Series([1.,2.,3.],index=['a','b','c']),
  'two': pd.Series([1.,2.,3.,4.],index=['a','b','c','d'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [34]:
data={'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}


# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
print(df)
# select two columns
print(df[['Name', 'Qualification']])

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [38]:
print("Delete the first column:")
del df['Name']
print(df)

Delete the first column:
   Age    Address Qualification
0   27      Delhi           Msc
1   24     Kanpur            MA
2   22  Allahabad           MCA
3   32    Kannauj           Phd

In [39]:
#dataframe[col][row]=value...........MODIFY VALUE
df['Age'][1]=700
print(df)

   Age    Address Qualification
0   27      Delhi           Msc
1  700     Kanpur            MA
2   22  Allahabad           MCA
3   32    Kannauj           Phd

<ipython-input-39-e0e18c8d55a1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'][1]=700

In [40]:
df2= pd.DataFrame({'A':1.,
                  'B': pd.Timestamp('20210518'),
                   'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"],dtype='category'),
                   'F': 'foo', })
df2

     A          B    C  D      E    F
0  1.0 2021-05-18  1.0  3   test  foo
1  1.0 2021-05-18  1.0  3  train  foo
2  1.0 2021-05-18  1.0  3   test  foo
3  1.0 2021-05-18  1.0  3  train  foo

In [41]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [42]:
dates = pd.date_range('20211206',periods=6)
dates

DatetimeIndex(['2021-12-06', '2021-12-07', '2021-12-08', '2021-12-09',
               '2021-12-10', '2021-12-11'],
              dtype='datetime64[ns]', freq='D')

In [44]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2021-12-06  2.023872  2.234097 -0.761995 -1.317097
2021-12-07  1.172350 -0.060137 -1.758247  0.121604
2021-12-08  0.548199 -0.205218 -0.149739 -1.305000
2021-12-09  0.733352  0.855480 -0.319997  0.748924
2021-12-10  0.189980 -0.881355  0.366559  0.899307
2021-12-11  0.381736 -0.496831  1.693120 -0.347277

In [45]:
df[0:3]

                   A         B         C         D
2021-12-06  2.023872  2.234097 -0.761995 -1.317097
2021-12-07  1.172350 -0.060137 -1.758247  0.121604
2021-12-08  0.548199 -0.205218 -0.149739 -1.305000

In [46]:
df.loc[dates[1]]

A    1.172350
B   -0.060137
C   -1.758247
D    0.121604
Name: 2021-12-07 00:00:00, dtype: float64

In [47]:
df.loc['2021-12-07',['A','B']]

A    1.172350
B   -0.060137
Name: 2021-12-07 00:00:00, dtype: float64

In [48]:
df.iloc[3]

A    0.733352
B    0.855480
C   -0.319997
D    0.748924
Name: 2021-12-09 00:00:00, dtype: float64

In [49]:
df.iloc[3:5,0:2]

                   A         B
2021-12-09  0.733352  0.855480
2021-12-10  0.189980 -0.881355